#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.main: Refreshing state... [id=vpc-0019a2de5322a3397]
aws_ssm_parameter.foo: Refreshing state... [id=foo]
data.aws_availability_zones.all: Reading...
data.aws_availability_zones.all: Read complete after 0s [id=us-east-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_subnet.private-subnet[0] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-1"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-1"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private-subnet[1] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-2"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-2"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private-subnet[2] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-3"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-3"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private-subnet[3] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.104.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-4"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-4"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private-subnet[4] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1e"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.105.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-5"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-5"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.private-subnet[5] will be created
  + resource "aws_subnet" "private-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1f"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.106.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-6"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "private-subnet-6"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[0] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-1"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-1"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[1] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-2"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-2"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[2] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-3"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-3"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[3] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-4"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-4"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[4] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1e"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-5"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-5"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

  # aws_subnet.public-subnet[5] will be created
  + resource "aws_subnet" "public-subnet" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1f"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-6"
          + "Owner"       = "Shubham"
        }
      + tags_all                                       = {
          + "Environment" = "Production"
          + "Name"        = "public-subnet-6"
          + "Owner"       = "Shubham"
        }
      + vpc_id                                         = "vpc-0019a2de5322a3397"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*